#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_route53_zone.this: Reading...
aws_cloudfront_origin_access_control.www: Refreshing state... [id=E39OMYXBNCIZAR]
data.aws_acm_certificate.www: Reading...
aws_route53_record.www: Refreshing state... [id=Z05346383CF9J3IH2UIOG_www.capnduck.com_A]
aws_s3_bucket.www: Refreshing state... [id=capnduck.com]
data.aws_route53_zone.this: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
aws_s3_bucket_website_configuration.www: Refreshing state... [id=capnduck.com]
aws_s3_bucket_public_access_block.www: Refreshing state... [id=capnduck.com]
aws_s3_bucket_versioning.www: Refreshing state... [id=capnduck.com]
aws_s3_bucket_server_side_encryption_configuration.www: Refreshing state... [id=capnduck.com]
aws_s3_bucket_ownership_controls.www: Refreshing state... [id=capnduck.com]
aws_s3_object.www["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.www["speed.html"]: Refreshing state... [id=speed.html]
aws_s3_object.www["error.html"]: Refreshing state... [id=error.html]
data.aws_acm_certificate.www: Read complete after 0s [id=arn:aws:acm:us-east-1:009727205366:certificate/65eb02c7-3eac-442e-b549-e3e00d4ac020]
aws_cloudfront_distribution.www: Refreshing state... [id=E1DZ3AG82N8XHH]
aws_s3_bucket_acl.www: Refreshing state... [id=capnduck.com,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.apex will be created
  + resource "aws_route53_record" "apex" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "capnduck.com"
      + type            = "A"
      + zone_id         = "Z05346383CF9J3IH2UIOG"

      + alias {
          + evaluate_target_health = false
          + name                   = "d4gqbknmex5r5.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_record.www will be destroyed
  # (because aws_route53_record.www is not in configuration)
  - resource "aws_route53_record" "www" {
      - fqdn                             = "www.capnduck.com" -> null
      - id                               = "Z05346383CF9J3IH2UIOG_www.capnduck.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "www.capnduck.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z05346383CF9J3IH2UIOG" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "d4gqbknmex5r5.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_record.www_domain_name will be created
  + resource "aws_route53_record" "www_domain_name" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.capnduck.com"
      + records         = [
          + "capnduck.com",
        ]
      + ttl             = 30
      + type            = "CNAME"
      + zone_id         = "Z05346383CF9J3IH2UIOG"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jelliottio, Action: `pull_request`*